app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["post_id", 1], ["content", "Like what up"], ["created_at", 2016-11-08 22:44:45 UTC], ["updated_at", 2016-11-08 22:44:45 UTC]]
---
	def create
	  @comment = @post.comments.build(comment_params)
	  @comment.user_id = current_user.id

	  if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
	def destroy
	  @comment = @post.comments.find(params[:id])

	  @comment.destroy