app/controllers/posts_controller.rb

INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    if @post = Post.create(post_params)

UPDATE "posts" SET "image_file_name" = $1, "image_file_size" = $2, "image_updated_at" = $3, "caption" = $4, "updated_at" = $5 WHERE "posts"."id" = $6  [["image_file_name", "IMG_3700.JPG"], ["image_file_size", 6851764], ["image_updated_at", 2016-11-08 19:27:00 UTC], ["caption", "erndrew"], ["updated_at", 2016-11-08 19:27:01 UTC], ["id", 1]]
---
  def update
    if @post.update(post_params)